Catalogs/ЭКО_Контейнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЭКО_Контейнеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭКО_Контейнеры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если не ЗначениеЗаполнено(ИнвентарныйНомер) Тогда 

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЭКО_Контейнеры.Счетчик КАК Счетчик
			|ИЗ
			|	Справочник.ЭКО_Контейнеры КАК ЭКО_Контейнеры
			|
			|УПОРЯДОЧИТЬ ПО
			|	Счетчик УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ПСчетчик = 0;
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
			ПСчетчик = ВыборкаДетальныеЗаписи.Счетчик;	
		КонецЕсли;
		Счетчик = ПСчетчик + 1;
		Если ПСчетчик <10 Тогда 
			ССчетчик= "000" + Счетчик;
		ИначеЕсли ПСчетчик <100 Тогда 
			ССчетчик= "00" + Счетчик;
		ИначеЕсли ПСчетчик <1000 Тогда 
			ССчетчик= "0" + Счетчик;
		Иначе 	
			ССчетчик= ""+ Счетчик;
		КонецЕсли;
		
		ИнвентарныйНомер = "К16-" + Строка(ССчетчик);
		
		Наименование = ИнвентарныйНомер+"/"+Номенклатура.Наименование;
		
	КонецЕсли;
	

КонецПроцедуры
